


/**
 * 状态码
 * ```
 * 1000-2000 成功信息
 * 2000-3000 调试信息
 * 3000-4000 警告信息
 * 4000-5000 错误信息
 * 5000-6000 脚本内部错误
 * ```
 */
export enum Status {
    // 1000-2000
    "浏览器启动成功" = 1000,
    "验证码破解成功" = 1001,
    "登录成功" = 1002,


    // 2000-3000
    "等待用户自行登录中" = 2000,
    "脚本运行中" = 2010,


    // 3000-4000
    "未提供浏览器路径" = 3000,



    // 4000-5000
    "浏览器路径无效" = 4000,
    "浏览器启动失败" = 4001,

    "未提供验证码破解的账号和密码" = 4010,
    "验证码破解失败" = 40011,

    "登录失败" = 4020,
    "自动登录运行超过限制次数" = 4021,

    // 5000-6000
    "网络错误" = 5000,
    "脚本运行超时" = 5010,
    "脚本执行错误" = 5011,
    "脚本执行的元素不存在" = 5012,

    

}
 